<a href="https://colab.research.google.com/github/x87170/3rd-ML100Days/blob/master/Esun_QuantTeam_Lesson_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Python Course for Esun Quant Team July 27, 2020**
### **Agenda**


- Lesson 3 - Pandas-Group by

- Lesson 4 - Sklearn

## **Lession 3 - Pandas更多應用**

### **Group by**

##### 有時會需要做資料統整的處理，這時會使用到groupby的功能

```
df.groupby(['需要作為樞紐的key']).sum()
```
並且看要做出何種處理(案例中用加總舉例)

In [ ]:
#e.g. 以下表格為各顧客總AUM資料
#讀進資料
df3 = pd.read_csv('CM.csv',encoding= 'BIG5')

#因顧客資料無法進行運算，先刪除
df3.drop(columns=['Cust_No'],inplace = True)

#以各區域進行加總
df_region = df3.groupby('Region').sum()
df_region.head()

             AUM
Region
北市三     16984502
北市二     14520154
北高雄      2323123
南台中      9874410
南高雄       874574

In [ ]:
#以各區及分行進行加總
df_div = df3.groupby(['Region','Division']).sum()
df_div.head()

                      AUM
Region Division
北市三    基隆路        9000000
       敦南         7984502
北市二    營業部       14520154
北高雄    岡山         2323123
南台中    員林         9874410

In [ ]:
#以各IC進行加總
df_IC = df3.groupby('IC_Name').sum()
df_IC.head()

               AUM
IC_Name
Andy       6666666
Billy      2323123
Candy      5454755
David      9874410
Eric     150597391

### **排序**

##### 若需要排序資料,使用`df.sort_values(by=, ascending= True )`
其中by填入要排序的欄，ascending表示是否要升冪排列(由小到大)

In [ ]:
df_IC.sort_values('AUM',ascending=False)

               AUM
IC_Name
Eric     150597391
Peter     76157315
Thor      46427521
Tina      35760094
David      9874410
Andy       6666666
Linda      5531909
Candy      5454755
Billy      2323123
John       1234210
Henrry      987578
Frank       874574

### **資料合併Concat, Merge**

#####  
**Concat-**
最主要用在多個表格的串接，單純的直向or橫向併表格
```
pd.concat([df1,df2,df3], axis = 0) #直向
pd.concat([df1,df2,df3], axis = 1) #橫向
```

In [ ]:
import pandas as pd
df1 = pd.DataFrame({'A':[1,2,3],'B':[4,5,6]})
df2 = pd.DataFrame({'A':[1,6,7],'D':[7,8,9]})
pd.concat([df1,df2],axis=0) #可加入ignore_index = True/False

   A    B    D
0  1  4.0  NaN
1  2  5.0  NaN
2  3  6.0  NaN
0  1  NaN  7.0
1  6  NaN  8.0
2  7  NaN  9.0

In [ ]:
pd.concat([df1,df2],axis=1) #可加入ignore_index = True/False

   A  B  A  D
0  1  4  1  7
1  2  5  6  8
2  3  6  7  9

#####  
**Merge-**
最主要用在兩個表格的串接，可選擇要串接的key值

In [ ]:
pd.merge(df1,df2,on='A', how = 'inner')#交集
pd.merge(df1,df2,on='A', how = 'outer')#聯集
pd.merge(df1,df2,on='A', how = 'left')#以左邊df為準進行合併
pd.merge(df1,df2,on='A', how = 'right')#以右邊df為準進行合併

   A    B  D
0  1  4.0  7
1  6  NaN  8
2  7  NaN  9

# **作業**

#### **HW 2**
#####研究員想要處理H0A0以及USGG兩個時間序列資料，但兩個資料檔日期有不一致情形，請協助研究員使用merge將資料做好預處理

#### **HW 3**
#####研究員想要比較在不同時間中債券指數的組成分中，是否有重複的項目，並想了解價格變動的狀況，請協助研究員找出來